app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
	def index

		@country = Country.all

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@country = Country.find(params[:id])

INSERT INTO "countries" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Philipins"], ["created_at", 2016-10-19 06:03:54 UTC], ["updated_at", 2016-10-19 06:03:54 UTC]]
---
	def create

		@country = Country.new(country_params)

		if @country.save

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def edit

		@country = Country.find(params[:id])

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "countries" SET "name" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["name", "indonesiaaa"], ["updated_at", 2016-10-19 07:02:05 UTC], ["id", 3]]
---
	def update

		@country = Country.find(params[:id])

		if @country.update(country_params)